# объявление функции
def number_to_words(num):
    to_20 = ['','один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять', 'десять',     'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать']
    dec = ['', '', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
    if num < 20:
        return to_20[num]
    elif num % 10 == 0:
        return dec[num//10]
    else:    
        return dec[num // 10] + ' ' + to_20[num % 10] 

# считываем данные
n = int(input())

# вызываем функцию
print(number_to_words(n))